name: "AlexNetCartPole"
layer 
{
   name: "data"
   type: "MemoryData"
   top: "data"
   include 
   {
      phase: TRAIN
   }
   transform_param 
   {
      color_order: RGB
   }
   memory_data_param 
   {
      batch_size: 32
      channels: 4
      height: 1
      width: 1
      label_channels: 1
      label_height: 1
      label_width: 1
      label_type: NONE
   }
}
layer 
{
   name: "dense1"
   type: "InnerProduct"
   bottom: "data"
   top: "x"
   param 
   {
      lr_mult: 1
      decay_mult: 2
   }
   param 
   {
      lr_mult: 1
      decay_mult: 0
   }
   inner_product_param 
   {
      num_output: 128
      bias_term: True
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
      bias_filler 
      {
         type: "constant"
         value: 0.1
      }
      axis: 1
   }
}
layer 
{
   name: "elu1"
   type: "ELU"
   bottom: "x"
   top: "x"
}
layer 
{
   name: "actions"
   type: "InnerProduct"
   bottom: "x"
   top: "actions"
   param 
   {
      lr_mult: 1
      decay_mult: 2
   }
   param 
   {
      lr_mult: 1
      decay_mult: 0
   }
   inner_product_param 
   {
      num_output: 2
      bias_term: True
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
      bias_filler 
      {
         type: "constant"
         value: 0.1
      }
      axis: 1
   }
}
layer 
{
   name: "softmax1"
   type: "Softmax"
   bottom: "actions"
   top: "softmax1"
}
layer 
{
   name: "values"
   type: "InnerProduct"
   bottom: "x"
   top: "value"
   param 
   {
      lr_mult: 1
      decay_mult: 2
   }
   param 
   {
      lr_mult: 1
      decay_mult: 0
   }
   inner_product_param 
   {
      num_output: 1
      bias_term: True
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
      bias_filler 
      {
         type: "constant"
         value: 0.1
      }
      axis: 1
   }
}
layer 
{
   name: "mvn1"
   type: "MVN"
   bottom: "value"
   top: "mvn1"
}
layer 
{
   name: "loss1"
   type: "MemoryLoss"
   bottom: "mvn1"
   bottom: "actions"
   top: "loss1"
   loss_weight: 1
   loss_param 
   {
      normalization: VALID
   }
}
