name: "ResNet-50"
layer 
{
   name: "data"
   type: "Data"
   top: "data"
   top: "label"
   include 
   {
      phase: TRAIN
   }
   transform_param 
   {
      scale: 0.00390625
      mirror: True
      use_imagedb_mean: True
      color_order: RGB
   }
   data_param 
   {
      source: "CIFAR-10_56x56.training"
      batch_size: 64
      backend: IMAGEDB
      enable_random_selection: True
   }
}
layer 
{
   name: "data"
   type: "Data"
   top: "data"
   top: "label"
   include 
   {
      phase: TEST
   }
   transform_param 
   {
      scale: 0.00390625
      use_imagedb_mean: True
      color_order: RGB
   }
   data_param 
   {
      source: "CIFAR-10_56x56.testing"
      batch_size: 64
      backend: IMAGEDB
      enable_random_selection: True
   }
}
layer 
{
   name: "conv1"
   type: "Convolution"
   bottom: "data"
   top: "conv1"
   convolution_param 
   {
      kernel_size: 7
      stride: 1
      pad: 3
      dilation: 1
      num_output: 64
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
      bias_filler 
      {
         type: "constant"
         value: 0.1
      }
   }
}
layer 
{
   name: "bn_conv1"
   type: "LRN"
   bottom: "conv1"
   top: "conv1"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale_conv1"
   type: "Scale"
   bottom: "conv1"
   top: "conv1"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "conv1_relu"
   type: "ReLU"
   bottom: "conv1"
   top: "conv1"
}
layer 
{
   name: "pool1"
   type: "Pooling"
   bottom: "conv1"
   top: "pool1"
   pooling_param 
   {
      kernel_size: 3
      stride: 2
      pool: MAX
   }
}
layer 
{
   name: "res2a_branch1"
   type: "Convolution"
   bottom: "pool1"
   top: "res2a_branch1"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2a_branch1"
   type: "LRN"
   bottom: "res2a_branch1"
   top: "res2a_branch1"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2a_branch1"
   type: "Scale"
   bottom: "res2a_branch1"
   top: "res2a_branch1"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2a_branch2a"
   type: "Convolution"
   bottom: "pool1"
   top: "res2a_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2a_branch2a"
   type: "LRN"
   bottom: "res2a_branch2a"
   top: "res2a_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2a_branch2a"
   type: "Scale"
   bottom: "res2a_branch2a"
   top: "res2a_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2a_branch2a_relu"
   type: "ReLU"
   bottom: "res2a_branch2a"
   top: "res2a_branch2a"
}
layer 
{
   name: "res2a_branch2b"
   type: "Convolution"
   bottom: "res2a_branch2a"
   top: "res2a_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2a_branch2b"
   type: "LRN"
   bottom: "res2a_branch2b"
   top: "res2a_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2a_branch2b"
   type: "Scale"
   bottom: "res2a_branch2b"
   top: "res2a_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2a_branch2b_relu"
   type: "ReLU"
   bottom: "res2a_branch2b"
   top: "res2a_branch2b"
}
layer 
{
   name: "res2a_branch2c"
   type: "Convolution"
   bottom: "res2a_branch2b"
   top: "res2a_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2a_branch2c"
   type: "LRN"
   bottom: "res2a_branch2c"
   top: "res2a_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2a_branch2c"
   type: "Scale"
   bottom: "res2a_branch2c"
   top: "res2a_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2a"
   type: "Eltwise"
   bottom: "res2a_branch1"
   bottom: "res2a_branch2c"
   top: "res2a"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res2a_relu"
   type: "ReLU"
   bottom: "res2a"
   top: "res2a"
}
layer 
{
   name: "res2b_branch2a"
   type: "Convolution"
   bottom: "res2a"
   top: "res2b_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2b_branch2a"
   type: "LRN"
   bottom: "res2b_branch2a"
   top: "res2b_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2b_branch2a"
   type: "Scale"
   bottom: "res2b_branch2a"
   top: "res2b_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2b_branch2a_relu"
   type: "ReLU"
   bottom: "res2b_branch2a"
   top: "res2b_branch2a"
}
layer 
{
   name: "res2b_branch2b"
   type: "Convolution"
   bottom: "res2b_branch2a"
   top: "res2b_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2b_branch2b"
   type: "LRN"
   bottom: "res2b_branch2b"
   top: "res2b_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2b_branch2b"
   type: "Scale"
   bottom: "res2b_branch2b"
   top: "res2b_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2b_branch2b_relu"
   type: "ReLU"
   bottom: "res2b_branch2b"
   top: "res2b_branch2b"
}
layer 
{
   name: "res2b_branch2c"
   type: "Convolution"
   bottom: "res2b_branch2b"
   top: "res2b_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2b_branch2c"
   type: "LRN"
   bottom: "res2b_branch2c"
   top: "res2b_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2b_branch2c"
   type: "Scale"
   bottom: "res2b_branch2c"
   top: "res2b_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2b"
   type: "Eltwise"
   bottom: "res2a"
   bottom: "res2b_branch2c"
   top: "res2b"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res2b_relu"
   type: "ReLU"
   bottom: "res2b"
   top: "res2b"
}
layer 
{
   name: "res2c_branch2a"
   type: "Convolution"
   bottom: "res2b"
   top: "res2c_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2c_branch2a"
   type: "LRN"
   bottom: "res2c_branch2a"
   top: "res2c_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2c_branch2a"
   type: "Scale"
   bottom: "res2c_branch2a"
   top: "res2c_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2c_branch2a_relu"
   type: "ReLU"
   bottom: "res2c_branch2a"
   top: "res2c_branch2a"
}
layer 
{
   name: "res2c_branch2b"
   type: "Convolution"
   bottom: "res2c_branch2a"
   top: "res2c_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 64
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2c_branch2b"
   type: "LRN"
   bottom: "res2c_branch2b"
   top: "res2c_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2c_branch2b"
   type: "Scale"
   bottom: "res2c_branch2b"
   top: "res2c_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2c_branch2b_relu"
   type: "ReLU"
   bottom: "res2c_branch2b"
   top: "res2c_branch2b"
}
layer 
{
   name: "res2c_branch2c"
   type: "Convolution"
   bottom: "res2c_branch2b"
   top: "res2c_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn2c_branch2c"
   type: "LRN"
   bottom: "res2c_branch2c"
   top: "res2c_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale2c_branch2c"
   type: "Scale"
   bottom: "res2c_branch2c"
   top: "res2c_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res2c"
   type: "Eltwise"
   bottom: "res2b"
   bottom: "res2c_branch2c"
   top: "res2c"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res2c_relu"
   type: "ReLU"
   bottom: "res2c"
   top: "res2c"
}
layer 
{
   name: "res3a_branch1"
   type: "Convolution"
   bottom: "res2c"
   top: "res3a_branch1"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3a_branch1"
   type: "LRN"
   bottom: "res3a_branch1"
   top: "res3a_branch1"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3a_branch1"
   type: "Scale"
   bottom: "res3a_branch1"
   top: "res3a_branch1"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3a_branch2a"
   type: "Convolution"
   bottom: "res2c"
   top: "res3a_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3a_branch2a"
   type: "LRN"
   bottom: "res3a_branch2a"
   top: "res3a_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3a_branch2a"
   type: "Scale"
   bottom: "res3a_branch2a"
   top: "res3a_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3a_branch2a_relu"
   type: "ReLU"
   bottom: "res3a_branch2a"
   top: "res3a_branch2a"
}
layer 
{
   name: "res3a_branch2b"
   type: "Convolution"
   bottom: "res3a_branch2a"
   top: "res3a_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3a_branch2b"
   type: "LRN"
   bottom: "res3a_branch2b"
   top: "res3a_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3a_branch2b"
   type: "Scale"
   bottom: "res3a_branch2b"
   top: "res3a_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3a_branch2b_relu"
   type: "ReLU"
   bottom: "res3a_branch2b"
   top: "res3a_branch2b"
}
layer 
{
   name: "res3a_branch2c"
   type: "Convolution"
   bottom: "res3a_branch2b"
   top: "res3a_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3a_branch2c"
   type: "LRN"
   bottom: "res3a_branch2c"
   top: "res3a_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3a_branch2c"
   type: "Scale"
   bottom: "res3a_branch2c"
   top: "res3a_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3a"
   type: "Eltwise"
   bottom: "res3a_branch1"
   bottom: "res3a_branch2c"
   top: "res3a"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res3a_relu"
   type: "ReLU"
   bottom: "res3a"
   top: "res3a"
}
layer 
{
   name: "res3b_branch2a"
   type: "Convolution"
   bottom: "res3a"
   top: "res3b_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3b_branch2a"
   type: "LRN"
   bottom: "res3b_branch2a"
   top: "res3b_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3b_branch2a"
   type: "Scale"
   bottom: "res3b_branch2a"
   top: "res3b_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3b_branch2a_relu"
   type: "ReLU"
   bottom: "res3b_branch2a"
   top: "res3b_branch2a"
}
layer 
{
   name: "res3b_branch2b"
   type: "Convolution"
   bottom: "res3b_branch2a"
   top: "res3b_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3b_branch2b"
   type: "LRN"
   bottom: "res3b_branch2b"
   top: "res3b_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3b_branch2b"
   type: "Scale"
   bottom: "res3b_branch2b"
   top: "res3b_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3b_branch2b_relu"
   type: "ReLU"
   bottom: "res3b_branch2b"
   top: "res3b_branch2b"
}
layer 
{
   name: "res3b_branch2c"
   type: "Convolution"
   bottom: "res3b_branch2b"
   top: "res3b_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3b_branch2c"
   type: "LRN"
   bottom: "res3b_branch2c"
   top: "res3b_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3b_branch2c"
   type: "Scale"
   bottom: "res3b_branch2c"
   top: "res3b_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3b"
   type: "Eltwise"
   bottom: "res3a"
   bottom: "res3b_branch2c"
   top: "res3b"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res3b_relu"
   type: "ReLU"
   bottom: "res3b"
   top: "res3b"
}
layer 
{
   name: "res3c_branch2a"
   type: "Convolution"
   bottom: "res3b"
   top: "res3c_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3c_branch2a"
   type: "LRN"
   bottom: "res3c_branch2a"
   top: "res3c_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3c_branch2a"
   type: "Scale"
   bottom: "res3c_branch2a"
   top: "res3c_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3c_branch2a_relu"
   type: "ReLU"
   bottom: "res3c_branch2a"
   top: "res3c_branch2a"
}
layer 
{
   name: "res3c_branch2b"
   type: "Convolution"
   bottom: "res3c_branch2a"
   top: "res3c_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3c_branch2b"
   type: "LRN"
   bottom: "res3c_branch2b"
   top: "res3c_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3c_branch2b"
   type: "Scale"
   bottom: "res3c_branch2b"
   top: "res3c_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3c_branch2b_relu"
   type: "ReLU"
   bottom: "res3c_branch2b"
   top: "res3c_branch2b"
}
layer 
{
   name: "res3c_branch2c"
   type: "Convolution"
   bottom: "res3c_branch2b"
   top: "res3c_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3c_branch2c"
   type: "LRN"
   bottom: "res3c_branch2c"
   top: "res3c_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3c_branch2c"
   type: "Scale"
   bottom: "res3c_branch2c"
   top: "res3c_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3c"
   type: "Eltwise"
   bottom: "res3b"
   bottom: "res3c_branch2c"
   top: "res3c"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res3c_relu"
   type: "ReLU"
   bottom: "res3c"
   top: "res3c"
}
layer 
{
   name: "res3d_branch2a"
   type: "Convolution"
   bottom: "res3c"
   top: "res3d_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3d_branch2a"
   type: "LRN"
   bottom: "res3d_branch2a"
   top: "res3d_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3d_branch2a"
   type: "Scale"
   bottom: "res3d_branch2a"
   top: "res3d_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3d_branch2a_relu"
   type: "ReLU"
   bottom: "res3d_branch2a"
   top: "res3d_branch2a"
}
layer 
{
   name: "res3d_branch2b"
   type: "Convolution"
   bottom: "res3d_branch2a"
   top: "res3d_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 128
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3d_branch2b"
   type: "LRN"
   bottom: "res3d_branch2b"
   top: "res3d_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3d_branch2b"
   type: "Scale"
   bottom: "res3d_branch2b"
   top: "res3d_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3d_branch2b_relu"
   type: "ReLU"
   bottom: "res3d_branch2b"
   top: "res3d_branch2b"
}
layer 
{
   name: "res3d_branch2c"
   type: "Convolution"
   bottom: "res3d_branch2b"
   top: "res3d_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn3d_branch2c"
   type: "LRN"
   bottom: "res3d_branch2c"
   top: "res3d_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale3d_branch2c"
   type: "Scale"
   bottom: "res3d_branch2c"
   top: "res3d_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res3d"
   type: "Eltwise"
   bottom: "res3c"
   bottom: "res3d_branch2c"
   top: "res3d"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res3d_relu"
   type: "ReLU"
   bottom: "res3d"
   top: "res3d"
}
layer 
{
   name: "res4a_branch1"
   type: "Convolution"
   bottom: "res3d"
   top: "res4a_branch1"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4a_branch1"
   type: "LRN"
   bottom: "res4a_branch1"
   top: "res4a_branch1"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4a_branch1"
   type: "Scale"
   bottom: "res4a_branch1"
   top: "res4a_branch1"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4a_branch2a"
   type: "Convolution"
   bottom: "res3d"
   top: "res4a_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4a_branch2a"
   type: "LRN"
   bottom: "res4a_branch2a"
   top: "res4a_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4a_branch2a"
   type: "Scale"
   bottom: "res4a_branch2a"
   top: "res4a_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4a_branch2a_relu"
   type: "ReLU"
   bottom: "res4a_branch2a"
   top: "res4a_branch2a"
}
layer 
{
   name: "res4a_branch2b"
   type: "Convolution"
   bottom: "res4a_branch2a"
   top: "res4a_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4a_branch2b"
   type: "LRN"
   bottom: "res4a_branch2b"
   top: "res4a_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4a_branch2b"
   type: "Scale"
   bottom: "res4a_branch2b"
   top: "res4a_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4a_branch2b_relu"
   type: "ReLU"
   bottom: "res4a_branch2b"
   top: "res4a_branch2b"
}
layer 
{
   name: "res4a_branch2c"
   type: "Convolution"
   bottom: "res4a_branch2b"
   top: "res4a_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4a_branch2c"
   type: "LRN"
   bottom: "res4a_branch2c"
   top: "res4a_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4a_branch2c"
   type: "Scale"
   bottom: "res4a_branch2c"
   top: "res4a_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4a"
   type: "Eltwise"
   bottom: "res4a_branch1"
   bottom: "res4a_branch2c"
   top: "res4a"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4a_relu"
   type: "ReLU"
   bottom: "res4a"
   top: "res4a"
}
layer 
{
   name: "res4b_branch2a"
   type: "Convolution"
   bottom: "res4a"
   top: "res4b_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4b_branch2a"
   type: "LRN"
   bottom: "res4b_branch2a"
   top: "res4b_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4b_branch2a"
   type: "Scale"
   bottom: "res4b_branch2a"
   top: "res4b_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4b_branch2a_relu"
   type: "ReLU"
   bottom: "res4b_branch2a"
   top: "res4b_branch2a"
}
layer 
{
   name: "res4b_branch2b"
   type: "Convolution"
   bottom: "res4b_branch2a"
   top: "res4b_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4b_branch2b"
   type: "LRN"
   bottom: "res4b_branch2b"
   top: "res4b_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4b_branch2b"
   type: "Scale"
   bottom: "res4b_branch2b"
   top: "res4b_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4b_branch2b_relu"
   type: "ReLU"
   bottom: "res4b_branch2b"
   top: "res4b_branch2b"
}
layer 
{
   name: "res4b_branch2c"
   type: "Convolution"
   bottom: "res4b_branch2b"
   top: "res4b_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4b_branch2c"
   type: "LRN"
   bottom: "res4b_branch2c"
   top: "res4b_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4b_branch2c"
   type: "Scale"
   bottom: "res4b_branch2c"
   top: "res4b_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4b"
   type: "Eltwise"
   bottom: "res4a"
   bottom: "res4b_branch2c"
   top: "res4b"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4b_relu"
   type: "ReLU"
   bottom: "res4b"
   top: "res4b"
}
layer 
{
   name: "res4c_branch2a"
   type: "Convolution"
   bottom: "res4b"
   top: "res4c_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4c_branch2a"
   type: "LRN"
   bottom: "res4c_branch2a"
   top: "res4c_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4c_branch2a"
   type: "Scale"
   bottom: "res4c_branch2a"
   top: "res4c_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4c_branch2a_relu"
   type: "ReLU"
   bottom: "res4c_branch2a"
   top: "res4c_branch2a"
}
layer 
{
   name: "res4c_branch2b"
   type: "Convolution"
   bottom: "res4c_branch2a"
   top: "res4c_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4c_branch2b"
   type: "LRN"
   bottom: "res4c_branch2b"
   top: "res4c_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4c_branch2b"
   type: "Scale"
   bottom: "res4c_branch2b"
   top: "res4c_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4c_branch2b_relu"
   type: "ReLU"
   bottom: "res4c_branch2b"
   top: "res4c_branch2b"
}
layer 
{
   name: "res4c_branch2c"
   type: "Convolution"
   bottom: "res4c_branch2b"
   top: "res4c_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4c_branch2c"
   type: "LRN"
   bottom: "res4c_branch2c"
   top: "res4c_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4c_branch2c"
   type: "Scale"
   bottom: "res4c_branch2c"
   top: "res4c_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4c"
   type: "Eltwise"
   bottom: "res4b"
   bottom: "res4c_branch2c"
   top: "res4c"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4c_relu"
   type: "ReLU"
   bottom: "res4c"
   top: "res4c"
}
layer 
{
   name: "res4d_branch2a"
   type: "Convolution"
   bottom: "res4c"
   top: "res4d_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4d_branch2a"
   type: "LRN"
   bottom: "res4d_branch2a"
   top: "res4d_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4d_branch2a"
   type: "Scale"
   bottom: "res4d_branch2a"
   top: "res4d_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4d_branch2a_relu"
   type: "ReLU"
   bottom: "res4d_branch2a"
   top: "res4d_branch2a"
}
layer 
{
   name: "res4d_branch2b"
   type: "Convolution"
   bottom: "res4d_branch2a"
   top: "res4d_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4d_branch2b"
   type: "LRN"
   bottom: "res4d_branch2b"
   top: "res4d_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4d_branch2b"
   type: "Scale"
   bottom: "res4d_branch2b"
   top: "res4d_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4d_branch2b_relu"
   type: "ReLU"
   bottom: "res4d_branch2b"
   top: "res4d_branch2b"
}
layer 
{
   name: "res4d_branch2c"
   type: "Convolution"
   bottom: "res4d_branch2b"
   top: "res4d_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4d_branch2c"
   type: "LRN"
   bottom: "res4d_branch2c"
   top: "res4d_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4d_branch2c"
   type: "Scale"
   bottom: "res4d_branch2c"
   top: "res4d_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4d"
   type: "Eltwise"
   bottom: "res4c"
   bottom: "res4d_branch2c"
   top: "res4d"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4d_relu"
   type: "ReLU"
   bottom: "res4d"
   top: "res4d"
}
layer 
{
   name: "res4e_branch2a"
   type: "Convolution"
   bottom: "res4d"
   top: "res4e_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4e_branch2a"
   type: "LRN"
   bottom: "res4e_branch2a"
   top: "res4e_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4e_branch2a"
   type: "Scale"
   bottom: "res4e_branch2a"
   top: "res4e_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4e_branch2a_relu"
   type: "ReLU"
   bottom: "res4e_branch2a"
   top: "res4e_branch2a"
}
layer 
{
   name: "res4e_branch2b"
   type: "Convolution"
   bottom: "res4e_branch2a"
   top: "res4e_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4e_branch2b"
   type: "LRN"
   bottom: "res4e_branch2b"
   top: "res4e_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4e_branch2b"
   type: "Scale"
   bottom: "res4e_branch2b"
   top: "res4e_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4e_branch2b_relu"
   type: "ReLU"
   bottom: "res4e_branch2b"
   top: "res4e_branch2b"
}
layer 
{
   name: "res4e_branch2c"
   type: "Convolution"
   bottom: "res4e_branch2b"
   top: "res4e_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4e_branch2c"
   type: "LRN"
   bottom: "res4e_branch2c"
   top: "res4e_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4e_branch2c"
   type: "Scale"
   bottom: "res4e_branch2c"
   top: "res4e_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4e"
   type: "Eltwise"
   bottom: "res4d"
   bottom: "res4e_branch2c"
   top: "res4e"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4e_relu"
   type: "ReLU"
   bottom: "res4e"
   top: "res4e"
}
layer 
{
   name: "res4f_branch2a"
   type: "Convolution"
   bottom: "res4e"
   top: "res4f_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4f_branch2a"
   type: "LRN"
   bottom: "res4f_branch2a"
   top: "res4f_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4f_branch2a"
   type: "Scale"
   bottom: "res4f_branch2a"
   top: "res4f_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4f_branch2a_relu"
   type: "ReLU"
   bottom: "res4f_branch2a"
   top: "res4f_branch2a"
}
layer 
{
   name: "res4f_branch2b"
   type: "Convolution"
   bottom: "res4f_branch2a"
   top: "res4f_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 256
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4f_branch2b"
   type: "LRN"
   bottom: "res4f_branch2b"
   top: "res4f_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4f_branch2b"
   type: "Scale"
   bottom: "res4f_branch2b"
   top: "res4f_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4f_branch2b_relu"
   type: "ReLU"
   bottom: "res4f_branch2b"
   top: "res4f_branch2b"
}
layer 
{
   name: "res4f_branch2c"
   type: "Convolution"
   bottom: "res4f_branch2b"
   top: "res4f_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 1024
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn4f_branch2c"
   type: "LRN"
   bottom: "res4f_branch2c"
   top: "res4f_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale4f_branch2c"
   type: "Scale"
   bottom: "res4f_branch2c"
   top: "res4f_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res4f"
   type: "Eltwise"
   bottom: "res4e"
   bottom: "res4f_branch2c"
   top: "res4f"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res4f_relu"
   type: "ReLU"
   bottom: "res4f"
   top: "res4f"
}
layer 
{
   name: "res5a_branch1"
   type: "Convolution"
   bottom: "res4f"
   top: "res5a_branch1"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 2048
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5a_branch1"
   type: "LRN"
   bottom: "res5a_branch1"
   top: "res5a_branch1"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5a_branch1"
   type: "Scale"
   bottom: "res5a_branch1"
   top: "res5a_branch1"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5a_branch2a"
   type: "Convolution"
   bottom: "res4f"
   top: "res5a_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 2
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5a_branch2a"
   type: "LRN"
   bottom: "res5a_branch2a"
   top: "res5a_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5a_branch2a"
   type: "Scale"
   bottom: "res5a_branch2a"
   top: "res5a_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5a_branch2a_relu"
   type: "ReLU"
   bottom: "res5a_branch2a"
   top: "res5a_branch2a"
}
layer 
{
   name: "res5a_branch2b"
   type: "Convolution"
   bottom: "res5a_branch2a"
   top: "res5a_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5a_branch2b"
   type: "LRN"
   bottom: "res5a_branch2b"
   top: "res5a_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5a_branch2b"
   type: "Scale"
   bottom: "res5a_branch2b"
   top: "res5a_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5a_branch2b_relu"
   type: "ReLU"
   bottom: "res5a_branch2b"
   top: "res5a_branch2b"
}
layer 
{
   name: "res5a_branch2c"
   type: "Convolution"
   bottom: "res5a_branch2b"
   top: "res5a_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 2048
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5a_branch2c"
   type: "LRN"
   bottom: "res5a_branch2c"
   top: "res5a_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5a_branch2c"
   type: "Scale"
   bottom: "res5a_branch2c"
   top: "res5a_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5a"
   type: "Eltwise"
   bottom: "res5a_branch1"
   bottom: "res5a_branch2c"
   top: "res5a"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res5a_relu"
   type: "ReLU"
   bottom: "res5a"
   top: "res5a"
}
layer 
{
   name: "res5b_branch2a"
   type: "Convolution"
   bottom: "res5a"
   top: "res5b_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5b_branch2a"
   type: "LRN"
   bottom: "res5b_branch2a"
   top: "res5b_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5b_branch2a"
   type: "Scale"
   bottom: "res5b_branch2a"
   top: "res5b_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5b_branch2a_relu"
   type: "ReLU"
   bottom: "res5b_branch2a"
   top: "res5b_branch2a"
}
layer 
{
   name: "res5b_branch2b"
   type: "Convolution"
   bottom: "res5b_branch2a"
   top: "res5b_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5b_branch2b"
   type: "LRN"
   bottom: "res5b_branch2b"
   top: "res5b_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5b_branch2b"
   type: "Scale"
   bottom: "res5b_branch2b"
   top: "res5b_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5b_branch2b_relu"
   type: "ReLU"
   bottom: "res5b_branch2b"
   top: "res5b_branch2b"
}
layer 
{
   name: "res5b_branch2c"
   type: "Convolution"
   bottom: "res5b_branch2b"
   top: "res5b_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 2048
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5b_branch2c"
   type: "LRN"
   bottom: "res5b_branch2c"
   top: "res5b_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5b_branch2c"
   type: "Scale"
   bottom: "res5b_branch2c"
   top: "res5b_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5b"
   type: "Eltwise"
   bottom: "res5a"
   bottom: "res5b_branch2c"
   top: "res5b"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res5b_relu"
   type: "ReLU"
   bottom: "res5b"
   top: "res5b"
}
layer 
{
   name: "res5c_branch2a"
   type: "Convolution"
   bottom: "res5b"
   top: "res5c_branch2a"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5c_branch2a"
   type: "LRN"
   bottom: "res5c_branch2a"
   top: "res5c_branch2a"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5c_branch2a"
   type: "Scale"
   bottom: "res5c_branch2a"
   top: "res5c_branch2a"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5c_branch2a_relu"
   type: "ReLU"
   bottom: "res5c_branch2a"
   top: "res5c_branch2a"
}
layer 
{
   name: "res5c_branch2b"
   type: "Convolution"
   bottom: "res5c_branch2a"
   top: "res5c_branch2b"
   convolution_param 
   {
      kernel_size: 3
      stride: 1
      pad: 1
      num_output: 512
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5c_branch2b"
   type: "LRN"
   bottom: "res5c_branch2b"
   top: "res5c_branch2b"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5c_branch2b"
   type: "Scale"
   bottom: "res5c_branch2b"
   top: "res5c_branch2b"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5c_branch2b_relu"
   type: "ReLU"
   bottom: "res5c_branch2b"
   top: "res5c_branch2b"
}
layer 
{
   name: "res5c_branch2c"
   type: "Convolution"
   bottom: "res5c_branch2b"
   top: "res5c_branch2c"
   convolution_param 
   {
      kernel_size: 1
      stride: 1
      pad: 0
      num_output: 2048
      bias_term: False
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
   }
}
layer 
{
   name: "bn5c_branch2c"
   type: "LRN"
   bottom: "res5c_branch2c"
   top: "res5c_branch2c"
   lrn_param 
   {
      local_size: 5
      alpha: 0.0001
      beta: 0.75
      norm_region: ACROSS_CHANNELS
      k: 2
   }
}
layer 
{
   name: "scale5c_branch2c"
   type: "Scale"
   bottom: "res5c_branch2c"
   top: "res5c_branch2c"
   scale_param 
   {
      bias_term: True
   }
}
layer 
{
   name: "res5c"
   type: "Eltwise"
   bottom: "res5b"
   bottom: "res5c_branch2c"
   top: "res5c"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "res5c_relu"
   type: "ReLU"
   bottom: "res5c"
   top: "res5c"
}
layer 
{
   name: "pool5"
   type: "Pooling"
   bottom: "res5c"
   top: "pool5"
   pooling_param 
   {
      kernel_size: 2
      stride: 2
      pad: 0
      pool: AVE
   }
}
layer 
{
   name: "fc1000"
   type: "InnerProduct"
   bottom: "pool5"
   top: "fc1000"
   inner_product_param 
   {
      num_output: 10
      bias_term: True
      weight_filler 
      {
         type: "xavier"
         variance_norm: FAN_IN
      }
      bias_filler 
      {
         type: "constant"
         value: 0.1
      }
      axis: 1
   }
}
layer 
{
   name: "accuracy"
   type: "Accuracy"
   bottom: "fc1000"
   bottom: "label"
   top: "accuracy"
   include 
   {
      phase: TEST
   }
}
layer 
{
   name: "loss"
   type: "SoftmaxWithLoss"
   bottom: "fc1000"
   bottom: "label"
   top: "loss"
   loss_param 
   {
      normalization: VALID
   }
}
