name: "BasicNet"
layer 
{
   name: "tokdata1"
   type: "TokenizedData"
   top: "tokdata1"
   top: "pos"
   top: "tgt"
   tokenized_data_param 
   {
      input_type: TEXT_FILE
      source: "C:\ProgramData\MyCaffe\test_data\data\text\test_input.txt"
      batch_size: 1
      block_size: 4
   }
}
layer 
{
   name: "wte"
   type: "Embed"
   bottom: "tokdata1"
   top: "tok_emb"
   param 
   {
      lr_mult: 1
      decay_mult: 0
   }
   embed_param 
   {
      num_output: 3
      input_dim: 5
      bias_term: False
      weight_filler 
      {
         type: "gaussian"
         mean: 0
         std: 0.02
      }
   }
}
layer 
{
   name: "wpe"
   type: "Embed"
   bottom: "pos"
   top: "pos_emb"
   param 
   {
      lr_mult: 1
      decay_mult: 0
   }
   embed_param 
   {
      num_output: 3
      input_dim: 4
      bias_term: False
      weight_filler 
      {
         type: "gaussian"
         mean: 0
         std: 0.02
      }
   }
}
layer 
{
   name: "eltwise1"
   type: "Eltwise"
   bottom: "tok_emb"
   bottom: "pos_emb"
   top: "eltwise1"
   eltwise_param 
   {
      operation: SUM
   }
}
layer 
{
   name: "tfb1"
   type: "TransformerBlock"
   bottom: "eltwise1"
   top: "tfb1"
   transformer_block_param 
   {
      layers: 1
      heads: 1
      embed: 3
      block_size: 4
      attn_dropout: 0
      resid_dropout: 0
   }
}
layer 
{
   name: "ln1"
   type: "LayerNorm"
   bottom: "tfb1"
   top: "ln1"
}
layer 
{
   name: "ip1"
   type: "InnerProduct"
   bottom: "ln1"
   top: "logits"
   param 
   {
      lr_mult: 1
      decay_mult: 2
   }
   inner_product_param 
   {
      num_output: 5
      bias_term: False
      weight_filler 
      {
         type: "gaussian"
         mean: 0
         std: 0.02
      }
      bias_filler 
      {
         type: "constant"
         value: 0
      }
      axis: 2
   }
}
layer 
{
   name: "loss1"
   type: "SoftmaxWithLoss"
   bottom: "logits"
   bottom: "tgt"
   top: "loss1"
   loss_param 
   {
      normalization: BATCH_SIZE
   }
   softmax_param 
   {
      axis: 2
   }
}
layer 
{
   name: "accuracy1"
   type: "Accuracy"
   bottom: "logits"
   bottom: "tgt"
   top: "accuracy1"
   include 
   {
      phase: TEST
   }
   accuracy_param 
   {
      axis: 2
   }
}
